In [1]:
import pandas as pd

In [16]:
df = pd.read_csv("sorted_data\colony_6_data_vid_1.csv")

In [17]:
df.drop(columns= {"Unnamed: 0",		"frame",	"video"	,"colony"	,"date",	"t"}, inplace= True)

In [18]:
df

     ant     x    y
0     14   288  816
1     14   292  832
2     14   320  832
3     14   344  828
4     14   356  828
..   ...   ...  ...
547   20  1044  232
548   20  1044  232
549   20  1044  236
550   20  1036  236
551   20  1028  244

[552 rows x 3 columns]

In [22]:
df["x_new"] = df["x"]/4

In [23]:
df["y_new"] = df["y"]/4

In [25]:
df

     ant     x    y  x_new  y_new
0     14   288  816   72.0  204.0
1     14   292  832   73.0  208.0
2     14   320  832   80.0  208.0
3     14   344  828   86.0  207.0
4     14   356  828   89.0  207.0
..   ...   ...  ...    ...    ...
547   20  1044  232  261.0   58.0
548   20  1044  232  261.0   58.0
549   20  1044  236  261.0   59.0
550   20  1036  236  259.0   59.0
551   20  1028  244  257.0   61.0

[552 rows x 5 columns]

In [24]:
df.to_csv("normalised_colony_6_data_vid_1.csv")